{
  "text": "UC Riverside\\nComputer Science and Engineering\\nWE ENGINEER EXCELLENCE\\n\\nHome\\nEvents\\nUndergraduate\\nGraduate\\nResearch\\nPeople\\nAbout\\nEngagement\\nBreadcrumb\\n  Undergraduate Program Overview  Undergraduate Course Descriptions\\nUndergraduate Course Descriptions\\nDescription of undergraduate courses offered during this academic year. Please refer to the General Catalog for a comprehensive and updated list of all Computer Science courses.\\n\\nNote: This partial list is provided to CS graduate students as a quick reference for undergraduate course descriptions.\\n\\nCourse\\tCourse Title\\tDescription\\nENGR 001\\tProfessional Development and Mentoring\\t1 Unit, Activity, 30 hours per quarter. Provides freshmen with involvement in professional development activities. Activities to be performed are program-specific, and may include projects, industry overviews and interactions, involvement with professional societies and clubs, team building, career guidance, and coverage of ethics and lifelong learning issues. E. Bioengineering; F. Chemical Engineering; G. Computer Engineering; I. Computer Science; J. Electrical Engineering; K. Environmental Engineering; M. Cmptr Scnce Business Applctns; N. Mechanical Engineering;\\nENGR 101\\tProfessional Development and Mentoring\\t1 Unit, Activity, 30 hours per quarter. Prerequisite(s): restricted to class level standing of junior; restricted to major(s) Bioengineering, Bioengineering BS + MS, Chemical Engineering, Chemical Engineering BS + MS, Computer Engineering, Computer Science, Computer Science BS + MS, Electrical Engineering, Electrical Engineering BS + MS, Environmental Engineering, Environmental Engr BS + MS, Materials Science and Engineer, Mechanical Engineering, Mechanical Engineering BS + MS. Provides juniors with involvement in professional development activities. Activities to be performed are program-specific, and may include projects, industry overviews and interactions, involvement with professional societies and clubs, team building, career guidance, and coverage of ethics and lifelong learning issues. E. Bioengineering; F. Chemical Engineering; G. Computer Engineering; I. Computer Science; J. Electrical Engineering; K. Environmental Engineering; M. Cmptr Scnce Business Applctns; N. Mechanical Engineering."
}